README.org
#+title: dotfiles

* Overview
This contains an Ansible playbook that deploys my configuration.
Each role configure something specific, with each role to some degree
indipendent of the other: you can see it as a module.
* Roles
This section is kind of a todo-list.

Planned roles:
- Brave browser
- shell configuration
- Pipewire and Pulseaudio masking
** misc-packages
- Add autojump
** awesome
- Rewrite configuration to literate programming
- Reload throws an error?
** menu
- Add the menuing part: right now it just install a dmenu script.
- Theme rofi.
** kitty
- In the end, this will be my backup
** emacs
- Move to straight-el
- Auto-tangle for org-files?
- vterm with multiple instances and shell integration
** mpd
- mpdscribble: why isn't it starting?
  Maybe it is waiting for mpd, which on start fails since ~/Music is
  not mounted
